Tekla Open API Reference for Tekla Structures 2025
AnalysisSupport Properties
The AnalysisSupport type exposes the following members.
Properties
Name | Description
Spring
 The spring values of the connectivity.
Support
 The connectivity type of the connectivity.
Top
See Also
Reference
AnalysisSupport Class
Tekla.Structures.Analysis Namespace